[
  {
    "id": "3",
    "company": "Binmile Technology",
    "companyUrl": "",
    "logo": "/companies/binmile-technology.svg",
    "location": "EMIT Building, D-42, Sector 59, Noida, Uttar Pradesh 201301",
    "type": "full-time",
    "roles": [
      {
        "title": "Software Developer",
        "startDate": "2024-03",
        "endDate": "Present",
        "description": "Working as a core contributor on multiple large-scale, production-ready products, including an event management platform, a primary e-commerce website, and an internal dashboard portal. Responsible for owning end-to-end full-stack development with a strong emphasis on scalability, performance, reliability, and long-term maintainability.",
        "achievements": [
          "Designed, developed, and deployed full-stack applications from scratch across multiple business-critical products",
          "Implemented secure and scalable authentication and authorization systems",
          "Optimized Docker images and CI/CD workflows to improve deployment efficiency and reduce infrastructure costs",
          "Significantly improved application performance, SEO, and Core Web Vitals for user-facing platforms",
          "Integrated LLM-powered features to streamline internal workflows and enhance product capabilities",
          "Built complex, high-quality UI/UX features with a strong focus on accessibility and usability",
          "Owned features end-to-end, from requirements gathering and technical design to production deployment"
        ],
        "tech": [
          "TypeScript",
          "Next.js",
          "React",
          "Node.js",
          "Docker",
          "Cloud Platforms",
          "PostgreSQL",
          "REST APIs",
          "Authentication & Security",
          "SEO",
          "LLMs"
        ]
      }
    ]
  },
  {
    "id": "2",
    "company": "Teevro Solutions Pvt Ltd",
    "companyUrl": "",
    "logo": "/companies/teevro-solutions.svg",
    "location": "India",
    "type": "internship",
    "roles": [
      {
        "title": "Full Stack Developer Intern",
        "startDate": "2023-01",
        "endDate": "2023-04",
        "description": "Completed a 4-month full-stack internship focused on building modern, performant, and scalable web applications using a contemporary JavaScript stack.",
        "achievements": [
          "Developed full-stack applications using Next.js for frontend and Node.js for backend services",
          "Integrated Sanity as a headless CMS to enable flexible and dynamic content management",
          "Built fast, SEO-friendly static and hybrid websites using Astro",
          "Collaborated with the team to design clean APIs and scalable application architecture"
        ],
        "tech": [
          "Next.js",
          "Node.js",
          "Sanity",
          "Astro",
          "JavaScript",
          "Full Stack Development"
        ]
      }
    ]
  },
  {
    "id": "1",
    "company": "Braeon Technocrats Private Limited",
    "companyUrl": "",
    "logo": "/companies/braeon-technocrats.svg",
    "location": "India",
    "type": "internship",
    "roles": [
      {
        "title": "ServiceNow Administration & Development Intern",
        "startDate": "2021-07",
        "endDate": "2021-10",
        "description": "Gained foundational experience in ServiceNow administration and development, focusing on configuring, managing, and extending applications within the ServiceNow ecosystem.",
        "achievements": [
          "Performed ServiceNow administration tasks including user, role, and instance configuration",
          "Assisted in developing and customizing ServiceNow applications, workflows, and modules",
          "Built a strong understanding of ServiceNow platform architecture and industry best practices"
        ],
        "tech": [
          "ServiceNow",
          "JavaScript",
          "ITSM",
          "ServiceNow Administration",
          "ServiceNow Development"
        ]
      }
    ]
  }
]
