{
  "name": "Jayant Rohila",
  "role": "Full-Stack Developer",
  "summary": "Software Developer with 2+ years of hands-on experience building scalable and reliable web applications. I specialize in many frameworks and libraries with a strong focus on clean architecture, performance optimization, and modern cloud-native development.",
  "bio": "I'm a Full-Stack Developer based in India with over two years of hands-on experience in building robust, user-centric web applications. I have worked across the full development lifecycle, from crafting responsive front-end interfaces to designing and deploying scalable backend systems.\n\nMy technical expertise includes React, Next.js, Node.js, TypeScript, Tailwind CSS, and cloud platforms such as AWS, Azure, and GCP. I have hands-on experience with Docker, including implementing multi-stage builds that reduced image sizes by up to 60%, enabling faster deployments and more efficient resource usage.\n\nI’ve also integrated and leveraged AI Large Language Models (LLMs) and tools like ChatGPT, Gemini, and Cursor IDE to enhance developer productivity and build intelligent features. I’m comfortable working in Agile environments, actively participating in sprints, collaborating with cross-functional teams, and continuously improving through iterative development.\n\nI’m passionate about writing maintainable, scalable code, integrating third-party APIs, and learning emerging technologies. I’m always open to opportunities where I can contribute, grow, and build impactful products.",
  "location": "India",
  "email": "jrohila55@gmail.com",
  "phone": "+91 98765 43210",
  "availability": {
    "status": "available",
    "message": "Open to new opportunities and freelance"
  },
  "avatar": "/avatar.jpg",
  "resume": "/resume.pdf",
  "social": [
    {
      "platform": "GitHub",
      "url": "https://github.com/jayantrohila",
      "icon": "GitHub",
      "label": "GitHub Profile"
    },
    {
      "platform": "LinkedIn",
      "url": "https://linkedin.com/in/jayantrohila",
      "icon": "LinkedIn",
      "label": "LinkedIn Profile"
    },
    {
      "platform": "Twitter",
      "url": "https://twitter.com/jayantrohila",
      "icon": "Twitter",
      "label": "Twitter Profile"
    },
    {
      "platform": "Dev.to",
      "url": "https://dev.to/jayantrohila",
      "icon": "DevTo",
      "label": "Dev.to Articles"
    }
  ]
}
