[
  {
    "id": "1",
    "quote": "Jayant is one of the most talented developers I've worked with. His ability to architect complex systems while keeping the code clean and maintainable is exceptional. He delivered our finance platform ahead of schedule and it's been rock solid in production.",
    "author": "Sarah Chen",
    "role": "CTO",
    "company": "TechCorp Solutions",
    "avatar": "/testimonials/sarah.jpg"
  },
  {
    "id": "2",
    "quote": "Working with Jayant was a game-changer for our engineering team. He didn't just write code—he established patterns and practices that elevated our entire team. The microservices architecture he designed has scaled beautifully.",
    "author": "Michael Torres",
    "role": "VP Engineering",
    "company": "CloudScale Inc.",
    "avatar": "/testimonials/michael.jpg"
  },
  {
    "id": "3",
    "quote": "Jayant has a rare combination of deep technical skills and excellent communication. He translated complex HIPAA requirements into a secure, user-friendly system that our patients love. Highly recommended.",
    "author": "Dr. Amanda Wright",
    "role": "Chief Medical Officer",
    "company": "HealthFirst Technologies",
    "avatar": "/testimonials/amanda.jpg"
  },
  {
    "id": "4",
    "quote": "I've hired Jayant for multiple projects over the years. He consistently delivers high-quality work on time. His expertise in React and Node.js is top-notch, and he's always up to date with the latest best practices.",
    "author": "David Kim",
    "role": "Founder",
    "company": "StartupHub",
    "avatar": "/testimonials/david.jpg"
  },
  {
    "id": "5",
    "quote": "Jayant transformed our slow, buggy dashboard into a fast, reliable tool that our team uses every day. His database optimization work alone saved us hours of waiting time weekly. True professional.",
    "author": "Lisa Patel",
    "role": "Product Manager",
    "company": "Analytics Co.",
    "avatar": "/testimonials/lisa.jpg"
  },
  {
    "id": "6",
    "quote": "As a junior developer on Jayant's team, I learned more in 6 months than in my previous two years. He's patient, thorough in code reviews, and genuinely invested in helping others grow. A fantastic mentor and leader.",
    "author": "Alex Johnson",
    "role": "Software Developer",
    "company": "TechCorp Solutions",
    "avatar": "/testimonials/alex.jpg"
  }
]
